// =================================================================
//* МОДЕЛИ ДАННЫХ (Data Models)
// Описываем основные сущности, которые передаются по сокету.
// =================================================================

export interface Message {
  id: string
  text: string
  senderId: string
  timestamp: string
}

// =================================================================
//* СОБЫТИЯ ОТ КЛИЕНТА К СЕРВЕРУ (Client -> Server)
// Описываем, какие события клиент может отправлять.
// Ключ - имя события.
// Значение - функция-обработчик, которая описывает, какие данные (payload) передаются.
// =================================================================

export interface ClientToServerEvents {
}

// =================================================================
//* СОБЫТИЯ ОТ СЕРВЕРА К КЛИЕНТУ (Server -> Client)
// Описываем, какие события сервер может присылать клиенту.
// =================================================================

export interface ServerToClientEvents {
  // --- Системные события Socket.IO ---
  connect: () => void
  disconnect: (reason: string) => void
  connect_error: (error: Error) => void

  // --- Общие события об ошибках ---
  error: (payload: { message: string, code?: number }) => void
}
